littleclock2/MSPM0-Examples/G3507-QiShiKeJi/G3507QiShiKeJi/example/1_LED/project.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "MSPM0G350X" --package "LQFP-64(PM)" --part "Default" --product "mspm0_sdk@1.20.01.06"
 * @versions {"tool":"1.18.1+3343"}
 */

/**
 * Import the modules used in this configuration.
 */
const GPIO   = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1  = GPIO.addInstance();
const SYSCTL = scripting.addModule("/ti/driverlib/SYSCTL");

/**
 * Write custom configuration values to the imported modules.
 */
GPIO1.$name                         = "LED";
GPIO1.associatedPins.create(8);
GPIO1.associatedPins[0].$name       = "LED0";
GPIO1.associatedPins[0].pin.$assign = "PA8";
GPIO1.associatedPins[1].$name       = "LED1";
GPIO1.associatedPins[1].pin.$assign = "PA9";
GPIO1.associatedPins[2].$name       = "LED2";
GPIO1.associatedPins[2].pin.$assign = "PA10";
GPIO1.associatedPins[3].$name       = "LED3";
GPIO1.associatedPins[3].pin.$assign = "PA11";
GPIO1.associatedPins[4].$name       = "LED4";
GPIO1.associatedPins[4].pin.$assign = "PA2";
GPIO1.associatedPins[5].$name       = "LED5";
GPIO1.associatedPins[5].pin.$assign = "PA3";
GPIO1.associatedPins[6].$name       = "LED6";
GPIO1.associatedPins[6].pin.$assign = "PA15";
GPIO1.associatedPins[7].$name       = "LED7";
GPIO1.associatedPins[7].pin.$assign = "PA5";

const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

SYSCTL.forceDefaultClkConfig = true;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
Board.peripheral.$suggestSolution          = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution = "PA20";
Board.peripheral.swdioPin.$suggestSolution = "PA19";
SYSCTL.peripheral.$suggestSolution         = "SYSCTL";
